import './CollectionDetails.css';
import './vote.css';
import DateFinish from './DateFinish';

function CollectionDetails() {
  return (
    <div className="collection collection-details-container">
      <button className="back-button">
        <div className="back-button-content">
          <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg" className="back-icon">
            <path d="M16 10H4M4 10L10 16M4 10L10 4" stroke="#2A2930" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round" />
          </svg>
          <span className="back-button-text">Назад</span>
        </div>
      </button>

      <div className="header-section">

        <div className="header-row">
          <h1 className="page-title">Все подборки</h1>
          <button className="expand-list-button">
            <span className="expand-list-text">Развернуть список....</span>
          </button>
        </div>

        <div className="vote">
          <div className="collections-grid">
            <div className="collection-card">
              <div className="collection-header">
                <div className="collection-name">
                  Поход в театр декабрь 2025
                </div>
                <div  className="collection-icons">
                  <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M6.11529 3.30602C7.06552 1.60201 7.54025 0.75 8.25049 0.75C8.96072 0.75 9.43546 1.60201 10.3857 3.30602L10.6317 3.74702C10.9017 4.23152 11.0367 4.47377 11.2467 4.63352C11.4567 4.79328 11.7192 4.85253 12.2441 4.97103L12.7211 5.07903C14.5661 5.49678 15.4878 5.70528 15.7076 6.41104C15.9266 7.11604 15.2981 7.8518 14.0404 9.32255L13.7149 9.70281C13.3579 10.1206 13.1786 10.3298 13.0984 10.5878C13.0181 10.8466 13.0451 11.1256 13.0991 11.6828L13.1486 12.1906C13.3384 14.1533 13.4336 15.1343 12.8591 15.5701C12.2846 16.0058 11.4207 15.6083 9.6942 14.8133L9.24646 14.6078C8.75598 14.3813 8.51073 14.2688 8.25049 14.2688C7.99024 14.2688 7.745 14.3813 7.25451 14.6078L6.80752 14.8133C5.08031 15.6083 4.21633 16.0058 3.6426 15.5708C3.06736 15.1343 3.16261 14.1533 3.35235 12.1906L3.40185 11.6836C3.45585 11.1256 3.48285 10.8466 3.40185 10.5886C3.32235 10.3298 3.14311 10.1206 2.78612 9.70356L2.46062 9.32255C1.2029 7.85255 0.574419 7.11679 0.793414 6.41104C1.01241 5.70528 1.93564 5.49603 3.78059 5.07903L4.25758 4.97103C4.78182 4.85253 5.04356 4.79328 5.25431 4.63352C5.46505 4.47377 5.5993 4.23152 5.86929 3.74702L6.11529 3.30602Z" fill="#A89A7F" stroke="#A89A7F" strokeWidth="1.5"/>
                  </svg>
                  <svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.125 3.375L12.66 10.8937C12.5415 12.8145 12.4823 13.7753 12 14.466C11.7619 14.8074 11.4554 15.0955 11.1 15.312C10.3822 15.75 9.42 15.75 7.4955 15.75C5.568 15.75 4.60425 15.75 3.885 15.3113C3.52942 15.0943 3.22291 14.8057 2.985 14.4637C2.5035 13.7722 2.445 12.81 2.3295 10.8863L1.875 3.375M0.75 3.375H14.25M10.542 3.375L10.0298 2.319C9.69 1.617 9.51975 1.26675 9.2265 1.04775C9.16136 0.999237 9.09238 0.956095 9.02025 0.91875C8.6955 0.75 8.3055 0.75 7.52625 0.75C6.72675 0.75 6.327 0.75 5.99625 0.9255C5.92314 0.964658 5.8534 1.00981 5.78775 1.0605C5.4915 1.28775 5.32575 1.6515 4.99425 2.37825L4.53975 3.375M5.625 11.625V7.125M9.375 11.625V7.125" stroke="#F44336" strokeWidth="1.5" strokeLinecap="round"/>
                  </svg>
                </div>
              </div>
              <div className="collection-footer">
                <div className="collection-count">
                  3 события в подборке
                </div>
                <div className="collection-date">
                  10.12.25
                </div>
              </div>
            </div>
            <div className="collection-card">
              <div className="collection-header">
                <div className="collection-name">
                  Поход в музей, январь 2026
                </div>
                <div  className="collection-icons">
                  <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M6.11529 3.30602C7.06552 1.60201 7.54025 0.75 8.25049 0.75C8.96072 0.75 9.43546 1.60201 10.3857 3.30602L10.6317 3.74702C10.9017 4.23152 11.0367 4.47377 11.2467 4.63352C11.4567 4.79328 11.7192 4.85253 12.2441 4.97103L12.7211 5.07903C14.5661 5.49678 15.4878 5.70528 15.7076 6.41104C15.9266 7.11604 15.2981 7.8518 14.0404 9.32255L13.7149 9.70281C13.3579 10.1206 13.1786 10.3298 13.0984 10.5878C13.0181 10.8466 13.0451 11.1256 13.0991 11.6828L13.1486 12.1906C13.3384 14.1533 13.4336 15.1343 12.8591 15.5701C12.2846 16.0058 11.4207 15.6083 9.6942 14.8133L9.24646 14.6078C8.75598 14.3813 8.51073 14.2688 8.25049 14.2688C7.99024 14.2688 7.745 14.3813 7.25451 14.6078L6.80752 14.8133C5.08031 15.6083 4.21633 16.0058 3.6426 15.5708C3.06736 15.1343 3.16261 14.1533 3.35235 12.1906L3.40185 11.6836C3.45585 11.1256 3.48285 10.8466 3.40185 10.5886C3.32235 10.3298 3.14311 10.1206 2.78612 9.70356L2.46062 9.32255C1.2029 7.85255 0.574419 7.11679 0.793414 6.41104C1.01241 5.70528 1.93564 5.49603 3.78059 5.07903L4.25758 4.97103C4.78182 4.85253 5.04356 4.79328 5.25431 4.63352C5.46505 4.47377 5.5993 4.23152 5.86929 3.74702L6.11529 3.30602Z" fill="#A89A7F" stroke="#A89A7F" strokeWidth="1.5"/>
                  </svg>
                  <svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.125 3.375L12.66 10.8937C12.5415 12.8145 12.4823 13.7753 12 14.466C11.7619 14.8074 11.4554 15.0955 11.1 15.312C10.3822 15.75 9.42 15.75 7.4955 15.75C5.568 15.75 4.60425 15.75 3.885 15.3113C3.52942 15.0943 3.22291 14.8057 2.985 14.4637C2.5035 13.7722 2.445 12.81 2.3295 10.8863L1.875 3.375M0.75 3.375H14.25M10.542 3.375L10.0298 2.319C9.69 1.617 9.51975 1.26675 9.2265 1.04775C9.16136 0.999237 9.09238 0.956095 9.02025 0.91875C8.6955 0.75 8.3055 0.75 7.52625 0.75C6.72675 0.75 6.327 0.75 5.99625 0.9255C5.92314 0.964658 5.8534 1.00981 5.78775 1.0605C5.4915 1.28775 5.32575 1.6515 4.99425 2.37825L4.53975 3.375M5.625 11.625V7.125M9.375 11.625V7.125" stroke="#F44336" strokeWidth="1.5" strokeLinecap="round"/>
                  </svg>
                </div>
              </div>
              <div className="collection-footer">
                <div className="collection-count">
                  5 событий в подборке
                </div>
                <div className="collection-date">
                  08.12.25
                </div>
              </div>
            </div>
            <div className="collection-card">
              <div className="collection-header">
                <div className="collection-name">
                  Варианты активностей на весенние каникулы 2026
                </div>
                <div  className="collection-icons">
                  <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M6.11529 3.30602C7.06552 1.60201 7.54025 0.75 8.25049 0.75C8.96072 0.75 9.43546 1.60201 10.3857 3.30602L10.6317 3.74702C10.9017 4.23152 11.0367 4.47377 11.2467 4.63352C11.4567 4.79328 11.7192 4.85253 12.2441 4.97103L12.7211 5.07903C14.5661 5.49678 15.4878 5.70528 15.7076 6.41104C15.9266 7.11604 15.2981 7.8518 14.0404 9.32255L13.7149 9.70281C13.3579 10.1206 13.1786 10.3298 13.0984 10.5878C13.0181 10.8466 13.0451 11.1256 13.0991 11.6828L13.1486 12.1906C13.3384 14.1533 13.4336 15.1343 12.8591 15.5701C12.2846 16.0058 11.4207 15.6083 9.6942 14.8133L9.24646 14.6078C8.75598 14.3813 8.51073 14.2688 8.25049 14.2688C7.99024 14.2688 7.745 14.3813 7.25451 14.6078L6.80752 14.8133C5.08031 15.6083 4.21633 16.0058 3.6426 15.5708C3.06736 15.1343 3.16261 14.1533 3.35235 12.1906L3.40185 11.6836C3.45585 11.1256 3.48285 10.8466 3.40185 10.5886C3.32235 10.3298 3.14311 10.1206 2.78612 9.70356L2.46062 9.32255C1.2029 7.85255 0.574419 7.11679 0.793414 6.41104C1.01241 5.70528 1.93564 5.49603 3.78059 5.07903L4.25758 4.97103C4.78182 4.85253 5.04356 4.79328 5.25431 4.63352C5.46505 4.47377 5.5993 4.23152 5.86929 3.74702L6.11529 3.30602Z" fill="#A89A7F" stroke="#A89A7F" strokeWidth="1.5"/>
                  </svg>
                  <svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.125 3.375L12.66 10.8937C12.5415 12.8145 12.4823 13.7753 12 14.466C11.7619 14.8074 11.4554 15.0955 11.1 15.312C10.3822 15.75 9.42 15.75 7.4955 15.75C5.568 15.75 4.60425 15.75 3.885 15.3113C3.52942 15.0943 3.22291 14.8057 2.985 14.4637C2.5035 13.7722 2.445 12.81 2.3295 10.8863L1.875 3.375M0.75 3.375H14.25M10.542 3.375L10.0298 2.319C9.69 1.617 9.51975 1.26675 9.2265 1.04775C9.16136 0.999237 9.09238 0.956095 9.02025 0.91875C8.6955 0.75 8.3055 0.75 7.52625 0.75C6.72675 0.75 6.327 0.75 5.99625 0.9255C5.92314 0.964658 5.8534 1.00981 5.78775 1.0605C5.4915 1.28775 5.32575 1.6515 4.99425 2.37825L4.53975 3.375M5.625 11.625V7.125M9.375 11.625V7.125" stroke="#F44336" strokeWidth="1.5" strokeLinecap="round"/>
                  </svg>
                </div>
              </div>
              <div className="collection-footer">
                <div className="collection-count">
                  5 событий в подборке
                </div>
                <div className="collection-date">
                  08.12.25
                </div>
              </div>
            </div>
            <div className="collection-card">
              <div className="collection-header">
                <div className="collection-name">
                  Театры, февраль 2026
                </div>
                <div  className="collection-icons">
                  <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M6.11529 3.30602C7.06552 1.60201 7.54025 0.75 8.25049 0.75C8.96072 0.75 9.43546 1.60201 10.3857 3.30602L10.6317 3.74702C10.9017 4.23152 11.0367 4.47377 11.2467 4.63352C11.4567 4.79328 11.7192 4.85253 12.2441 4.97103L12.7211 5.07903C14.5661 5.49678 15.4878 5.70528 15.7076 6.41104C15.9266 7.11604 15.2981 7.8518 14.0404 9.32255L13.7149 9.70281C13.3579 10.1206 13.1786 10.3298 13.0984 10.5878C13.0181 10.8466 13.0451 11.1256 13.0991 11.6828L13.1486 12.1906C13.3384 14.1533 13.4336 15.1343 12.8591 15.5701C12.2846 16.0058 11.4207 15.6083 9.6942 14.8133L9.24646 14.6078C8.75598 14.3813 8.51073 14.2688 8.25049 14.2688C7.99024 14.2688 7.745 14.3813 7.25451 14.6078L6.80752 14.8133C5.08031 15.6083 4.21633 16.0058 3.6426 15.5708C3.06736 15.1343 3.16261 14.1533 3.35235 12.1906L3.40185 11.6836C3.45585 11.1256 3.48285 10.8466 3.40185 10.5886C3.32235 10.3298 3.14311 10.1206 2.78612 9.70356L2.46062 9.32255C1.2029 7.85255 0.574419 7.11679 0.793414 6.41104C1.01241 5.70528 1.93564 5.49603 3.78059 5.07903L4.25758 4.97103C4.78182 4.85253 5.04356 4.79328 5.25431 4.63352C5.46505 4.47377 5.5993 4.23152 5.86929 3.74702L6.11529 3.30602Z" fill="#A89A7F" stroke="#A89A7F" strokeWidth="1.5"/>
                  </svg>
                  <svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.125 3.375L12.66 10.8937C12.5415 12.8145 12.4823 13.7753 12 14.466C11.7619 14.8074 11.4554 15.0955 11.1 15.312C10.3822 15.75 9.42 15.75 7.4955 15.75C5.568 15.75 4.60425 15.75 3.885 15.3113C3.52942 15.0943 3.22291 14.8057 2.985 14.4637C2.5035 13.7722 2.445 12.81 2.3295 10.8863L1.875 3.375M0.75 3.375H14.25M10.542 3.375L10.0298 2.319C9.69 1.617 9.51975 1.26675 9.2265 1.04775C9.16136 0.999237 9.09238 0.956095 9.02025 0.91875C8.6955 0.75 8.3055 0.75 7.52625 0.75C6.72675 0.75 6.327 0.75 5.99625 0.9255C5.92314 0.964658 5.8534 1.00981 5.78775 1.0605C5.4915 1.28775 5.32575 1.6515 4.99425 2.37825L4.53975 3.375M5.625 11.625V7.125M9.375 11.625V7.125" stroke="#F44336" strokeWidth="1.5" strokeLinecap="round"/>
                  </svg>
                </div>
              </div>
              <div className="collection-footer">
                <div className="collection-count">
                  5 событий в подборке
                </div>
                <div className="collection-date">
                  08.12.25
                </div>
              </div>
            </div>
            <div className="collection-card">
              <div className="collection-header">
                <div className="collection-name">
                  Подборка
                </div>
                <div  className="collection-icons">
                  <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M6.11529 3.30602C7.06552 1.60201 7.54025 0.75 8.25049 0.75C8.96072 0.75 9.43546 1.60201 10.3857 3.30602L10.6317 3.74702C10.9017 4.23152 11.0367 4.47377 11.2467 4.63352C11.4567 4.79328 11.7192 4.85253 12.2441 4.97103L12.7211 5.07903C14.5661 5.49678 15.4878 5.70528 15.7076 6.41104C15.9266 7.11604 15.2981 7.8518 14.0404 9.32255L13.7149 9.70281C13.3579 10.1206 13.1786 10.3298 13.0984 10.5878C13.0181 10.8466 13.0451 11.1256 13.0991 11.6828L13.1486 12.1906C13.3384 14.1533 13.4336 15.1343 12.8591 15.5701C12.2846 16.0058 11.4207 15.6083 9.6942 14.8133L9.24646 14.6078C8.75598 14.3813 8.51073 14.2688 8.25049 14.2688C7.99024 14.2688 7.745 14.3813 7.25451 14.6078L6.80752 14.8133C5.08031 15.6083 4.21633 16.0058 3.6426 15.5708C3.06736 15.1343 3.16261 14.1533 3.35235 12.1906L3.40185 11.6836C3.45585 11.1256 3.48285 10.8466 3.40185 10.5886C3.32235 10.3298 3.14311 10.1206 2.78612 9.70356L2.46062 9.32255C1.2029 7.85255 0.574419 7.11679 0.793414 6.41104C1.01241 5.70528 1.93564 5.49603 3.78059 5.07903L4.25758 4.97103C4.78182 4.85253 5.04356 4.79328 5.25431 4.63352C5.46505 4.47377 5.5993 4.23152 5.86929 3.74702L6.11529 3.30602Z" fill="#A89A7F" stroke="#A89A7F" strokeWidth="1.5"/>
                  </svg>
                  <svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.125 3.375L12.66 10.8937C12.5415 12.8145 12.4823 13.7753 12 14.466C11.7619 14.8074 11.4554 15.0955 11.1 15.312C10.3822 15.75 9.42 15.75 7.4955 15.75C5.568 15.75 4.60425 15.75 3.885 15.3113C3.52942 15.0943 3.22291 14.8057 2.985 14.4637C2.5035 13.7722 2.445 12.81 2.3295 10.8863L1.875 3.375M0.75 3.375H14.25M10.542 3.375L10.0298 2.319C9.69 1.617 9.51975 1.26675 9.2265 1.04775C9.16136 0.999237 9.09238 0.956095 9.02025 0.91875C8.6955 0.75 8.3055 0.75 7.52625 0.75C6.72675 0.75 6.327 0.75 5.99625 0.9255C5.92314 0.964658 5.8534 1.00981 5.78775 1.0605C5.4915 1.28775 5.32575 1.6515 4.99425 2.37825L4.53975 3.375M5.625 11.625V7.125M9.375 11.625V7.125" stroke="#F44336" strokeWidth="1.5" strokeLinecap="round"/>
                  </svg>
                </div>
              </div>
              <div className="collection-footer">
                <div className="collection-count">
                  0 событий в подборке
                </div>
                <div className="collection-date">
                  08.12.25
                </div>
              </div>
            </div>
          </div>
        </div>

        <div className="collection-info-section-divider">
          Выберите одну из подборок выше для просмотра событий и создания/завершения голосования
        </div>

      </div>

      <div className="collection-info-section">
        <div className="collection-info-row">
          <div className="collection-title-group">
            <h2 className="collection-title">События в подборке "Поход в театр декабрь 2025"</h2>
            <p className="collection-count-total">Всего 3 события</p>
            <div className="collection-info-section-divider">
              В этой подборке пока еще нет событий. Добавьте события из избранного класса.
            </div>
          </div>
          <div className="collection-actions">
            <button className="clear-button">
              <span className="clear-button-text">Очистить подборку</span>
            </button>
          </div>
        </div>
        

        <div className="input-actions-row">
          <div className="input-group">
          <label className="input-label">Ссылка на голосование</label>
            <label className="input-label input-label-finish">Голосование завершено!</label>
            <div className="input-field">
              <input type="text" value="https://kulturati.ru/?vote=v2pdrfib" className="input-value" />
              <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg" className="">
                <path d="M5.5 9.25C5.5 7.129 5.5 6.06775 6.15925 5.40925C6.81775 4.75 7.879 4.75 10 4.75H12.25C14.371 4.75 15.4323 4.75 16.0908 5.40925C16.75 6.06775 16.75 7.129 16.75 9.25V13C16.75 15.121 16.75 16.1823 16.0908 16.8408C15.4323 17.5 14.371 17.5 12.25 17.5H10C7.879 17.5 6.81775 17.5 6.15925 16.8408C5.5 16.1823 5.5 15.121 5.5 13V9.25Z" stroke="#C0C0C0" strokeWidth="1.5" />
                <path d="M5.5 15.25C4.90326 15.25 4.33097 15.0129 3.90901 14.591C3.48705 14.169 3.25 13.5967 3.25 13V8.5C3.25 5.67175 3.25 4.25725 4.129 3.379C5.008 2.50075 6.42175 2.5 9.25 2.5H12.25C12.8467 2.5 13.419 2.73705 13.841 3.15901C14.2629 3.58097 14.5 4.15326 14.5 4.75" stroke="#C0C0C0" strokeWidth="1.5" />
              </svg>
            </div>
          </div>

          <div className="button-group">
            <button className="action-button action-button-primary">
              <span className="action-button-text">Копировать ссылку</span>
            </button>
            <button className="action-button action-button-secondary">
              <span className="action-button-text">Сформировать PDF с итогами</span>
            </button>
            <button className="action-button action-button-danger">
              <span className="action-button-text action-button-text-danger">Завершить голосование</span>
            </button>
          </div>
        </div>

        <DateFinish />
      </div>
    </div>
  );
}

export default CollectionDetails;
